[
  {
    "raw_text": "Nebelwerk GmbH sucht ab sofort einen Senior Python Backend Developer (m/w/d) in München. Arbeitsmodell: Hybrid (3 Tage Büro, 2 Tage Remote). Vollzeit.\n\nÜber uns: Nebelwerk ist ein wachsendes Tech-Unternehmen, das Cloud-native Lösungen für den Mittelstand entwickelt.\n\nDeine Aufgaben:\n- Entwicklung und Wartung von Microservices in Python\n- Technische Konzeption neuer Features in enger Zusammenarbeit mit dem Produktteam\n- Code Reviews und Mentoring von Junior-Entwicklern\n- Optimierung der bestehenden Backend-Architektur hinsichtlich Performance und Skalierbarkeit\n\nDas bringst Du mit:\n- Mindestens 5 Jahre Berufserfahrung in der Python-Entwicklung\n- Fundierte Kenntnisse in FastAPI oder Django\n- Erfahrung mit relationalen Datenbanken (PostgreSQL)\n- Sicherer Umgang mit Git und CI/CD-Pipelines\n- Gute Kenntnisse in Docker und Kubernetes\n\nNice to have:\n- Erfahrung mit Event-Driven Architekturen (Kafka, RabbitMQ)\n- Kenntnisse in Terraform oder Pulumi\n- Beiträge zu Open-Source-Projekten\n\nGehalt: 72.000 – 92.000 € brutto/Jahr\n\nWir bieten:\n- 30 Tage Urlaub\n- Flexible Arbeitszeiten mit Gleitzeitmodell\n- Jobticket für den ÖPNV\n- Regelmäßige Teamevents und Weiterbildungsbudget (2.000 € / Jahr)\n- Betriebliche Altersvorsorge\n\nBewerbungsfrist: 31.03.2026\nJetzt bewerben unter: https://nebelwerk.example.de/karriere/senior-python-backend\n\nVeröffentlicht am 10.02.2026"
  },
  {
    "raw_text": "Machine Learning Engineer bei Lichtbogen AI AG (Berlin) – 100% Remote\n\nLichtbogen AI ist ein Berliner Startup, das sich auf deutschsprachige KI-Lösungen spezialisiert hat. Für unser NLP-Team suchen wir Verstärkung!\n\nDein Profil:\nDu hast ein abgeschlossenes Studium in Informatik, Mathematik oder einem vergleichbaren Fach und bringst mindestens 3 Jahre Erfahrung im Bereich Machine Learning mit. Du verfügst über sehr gute Kenntnisse in Python sowie PyTorch oder TensorFlow. Erfahrung mit MLOps-Tools wie MLflow, Kubeflow oder Weights & Biases ist uns wichtig. Du hast ein gutes Verständnis von NLP-Methoden und Transformer-Architekturen.\n\nWünschenswert wäre Erfahrung mit Large Language Models und RAG, Publikationen auf Konferenzen wie NeurIPS, ICML oder ACL, sowie Kenntnisse in Rust oder C++ für Performance-kritische Komponenten.\n\nDeine Rolle:\n* Entwicklung und Training von ML-Modellen für deutschsprachige NLP-Anwendungen\n* Aufbau und Pflege von ML-Pipelines für Training und Deployment\n* Evaluierung neuer Forschungsergebnisse und Übertragung in produktionsreife Lösungen\n* Enge Zusammenarbeit mit dem Data-Engineering-Team zur Datenaufbereitung\n\nVergütung: 65.000–85.000 EUR/Jahr je nach Erfahrung\n\nDas erwartet dich: 100% Remote-Arbeit innerhalb Deutschlands, 30 Tage Urlaub + 24.12. und 31.12. frei, Zugang zu GPU-Clustern für eigene Forschungsprojekte, Konferenzbudget und Weiterbildungsmöglichkeiten, monatlicher Zuschuss für Co-Working-Spaces.\n\nBewirb dich bis zum 15.04.2026 unter https://lichtbogen-ai.example.de/jobs/ml-engineer\n\n(Stellenanzeige vom 01.02.2026)"
  },
  {
    "raw_text": "Kernstadt Software Solutions GmbH | Frankfurt am Main\n\nJava Backend Entwickler (m/w/d) – Vollzeit, vor Ort\n\nWir sind ein etablierter IT-Dienstleister im Bankenumfeld und suchen einen erfahrenen Java-Entwickler für unser Team in Frankfurt.\n\nDeine Aufgaben umfassen die Weiterentwicklung der zentralen Transaktionsplattform, Integration externer Schnittstellen im Bankenumfeld, Sicherstellung der Code-Qualität durch Unit- und Integrationstests sowie Teilnahme an Architektur-Reviews und Sprint-Planungen.\n\nAnforderungen: Mind. 3 Jahre Erfahrung in der Java-Entwicklung (ab Java 17), gute Kenntnisse in Spring Boot und Spring Security, Erfahrung mit Messaging-Systemen wie Apache Kafka, Vertrautheit mit Clean Architecture und Domain-Driven Design. Fließende Deutschkenntnisse (mindestens C1) sind Voraussetzung.\n\nVon Vorteil: Erfahrung im Finanzsektor oder mit regulatorischen Anforderungen (BaFin), Kenntnisse in Kotlin, AWS- oder Azure-Zertifizierungen.\n\nJahresgehalt: 58.000 bis 75.000 EUR\n\nBenefits: Kantine mit Arbeitgeberzuschuss, zentrale Lage direkt am Hauptbahnhof, 28 Tage Urlaub + Sonderurlaub, vermögenswirksame Leistungen, bezuschusste Mitgliedschaft im Fitnessstudio.\n\nOnline veröffentlicht am 15. Februar 2026. Bewerbungen laufend möglich.\n\nMehr Infos und Bewerbung: https://kernstadt-solutions.example.de/stellenangebote/java-backend"
  },
  {
    "raw_text": "Stellenausschreibung – Rotorwerk Industrie AG, Stuttgart\n\n== Data Scientist – Predictive Maintenance (Senior) ==\n\nArbeitsort: Stuttgart (hybrid, 2 Tage Remote/Woche)\nAnstellung: Vollzeit, unbefristet\nGehaltsspanne: 78.000 – 98.000 € p.a.\n\nDie Rotorwerk Industrie AG ist ein führender Hersteller von Industrieanlagen. Im Rahmen unserer Digitalisierungsstrategie bauen wir unser Data-Science-Team weiter aus.\n\nIhre Qualifikationen:\n• Abgeschlossene Promotion oder Masterabschluss in Informatik, Physik, Maschinenbau oder verwandtem Fach\n• Mehrjährige Erfahrung in der Analyse von Zeitreihendaten und Anomalieerkennung\n• Sehr gute Kenntnisse in Python (scikit-learn, pandas, NumPy)\n• Erfahrung mit Cloud-Plattformen (AWS SageMaker oder Azure ML)\n• Verständnis von industriellen IoT-Systemen und Sensorik\n\nWünschenswert: Erfahrung mit Apache Spark oder Databricks, Kenntnisse in Bayes'scher Statistik und probabilistischer Programmierung, Grundkenntnisse in SPS-Programmierung.\n\nIhre Aufgaben:\n• Entwicklung von Predictive-Maintenance-Modellen für Fertigungsanlagen\n• Aufbereitung und Analyse großer Sensordatensätze\n• Präsentation von Ergebnissen vor Fachabteilungen und dem Management\n• Zusammenarbeit mit Ingenieuren zur Validierung der Modelle im Produktionsumfeld\n• Konzeption und Umsetzung von Dashboards zur Echtzeit-Überwachung\n\nWas wir bieten: 30 Tage Urlaub, tarifgebundenes Gehalt (IG Metall), betriebliche Altersvorsorge mit Arbeitgeberzuschuss, Firmenwagen oder BahnCard 100, Möglichkeit zu Forschungskooperationen mit Universitäten.\n\nBewerbungsschluss: 15.03.2026\nBewerben Sie sich jetzt: https://rotorwerk.example.de/karriere/data-scientist-pdm\n\nDatum der Veröffentlichung: 20.01.2026"
  },
  {
    "raw_text": "Hey! Wir sind Freischalt Digital, ein kleines Startup aus Hamburg-Schanze, und wir suchen eine:n Werkstudent:in für Python-Entwicklung.\n\nWas wir machen: Wir bauen eine SaaS-Plattform für kleine und mittelständische Unternehmen.\n\nWas du bei uns machst:\n- Unterstützung bei der Entwicklung interner Tools und Automatisierungen\n- Schreiben von Unit-Tests und Dokumentation\n- Mitarbeit an der API-Entwicklung für unsere SaaS-Plattform\n\nWas du mitbringen solltest:\n- Du studierst Informatik, Wirtschaftsinformatik oder was Vergleichbares\n- Gute Grundkenntnisse in Python\n- Erste Erfahrungen mit REST-APIs\n- Eigenständige und strukturierte Arbeitsweise\n- Gute Deutsch- und Englischkenntnisse\n\nBonus: Erfahrung mit FastAPI oder Flask, Grundkenntnisse in SQL, eigene Projekte auf GitHub.\n\nStundenlohn: 16–20 €/h je nach Erfahrung. Teilzeit, 15–20h pro Woche, hybrid.\n\nDarauf kannst du dich freuen: Flexible Arbeitszeiten, Möglichkeit zur Übernahme nach Studienabschluss, modernes Büro in der Schanze, kostenlose Getränke und Obst, MacBook als Arbeitsgerät.\n\nSchick uns deine Bewerbung bis zum 01.04.2026 an https://freischalt.example.de/jobs/werkstudent-python\n\nPosted: 18.02.2026"
  },
  {
    "raw_text": "DOPPELKERN CONSULTING GMBH\nWir suchen: Lead Java Architect (m/w/d)\nStandort: Düsseldorf | Hybrid | Vollzeit\n\nDoppelkern Consulting ist eine IT-Beratung mit Schwerpunkt auf Enterprise-Architekturen für Großkunden in der Versicherungs- und Logistikbranche. Zur Verstärkung unseres Teams suchen wir eine erfahrene Führungspersönlichkeit.\n\nIhre Verantwortung:\n→ Definition und Weiterentwicklung der technischen Gesamtarchitektur\n→ Technische Leitung eines crossfunktionalen Teams von 8 Entwicklern\n→ Bewertung und Einführung neuer Technologien und Frameworks\n→ Enge Abstimmung mit Stakeholdern und dem CTO\n→ Durchführung von technischen Interviews und Onboarding neuer Teammitglieder\n\nIhr Profil:\n→ Mindestens 8 Jahre Erfahrung in der Java/JVM-Entwicklung\n→ Tiefgehendes Verständnis von verteilten Systemen und Microservice-Architekturen\n→ Erfahrung mit Spring Cloud, Quarkus oder Micronaut\n→ Nachweisbare Führungserfahrung in technischen Teams (ab 5 Personen)\n→ Erfahrung mit Architecture Decision Records und technischer Dokumentation\n\nIdealerweise bringen Sie außerdem mit: TOGAF- oder iSAQB-Zertifizierung, Erfahrung mit Event Sourcing und CQRS, Kenntnisse in GraalVM und Native Image Compilation.\n\nVergütung: 95.000 – 120.000 € Jahresbrutto\n\nUnsere Benefits: 30 Tage Urlaub + Sabbatical-Option, Dienstwagen oder Mobilitätsbudget, jährliches Weiterbildungsbudget von 5.000 €, betriebliche Krankenversicherung, Home-Office-Pauschale (50 €/Monat).\n\nBitte bewerben Sie sich bis zum 30.04.2026 über unser Portal:\nhttps://doppelkern.example.de/karriere/lead-java-architect\n\nEingestellt am 05.02.2026"
  },
  {
    "raw_text": "Schaltkreis Analytics GmbH – MLOps Engineer (Köln, 100% Remote möglich)\n\nÜber die Stelle: Wir suchen eine:n MLOps Engineer, der/die unsere interne ML-Plattform aufbaut und betreibt. Du arbeitest eng mit unserem Data-Science-Team zusammen und sorgst dafür, dass Modelle zuverlässig in Produktion laufen. Remote innerhalb der EU möglich.\n\nDeine Aufgaben:\n- Aufbau und Betrieb der internen ML-Plattform auf Kubernetes\n- Automatisierung von Model-Training, -Validierung und -Deployment\n- Monitoring und Alerting für Modelle in Produktion (Drift Detection)\n- Zusammenarbeit mit Data Scientists zur Optimierung der Entwicklungszyklen\n\nDas solltest du mitbringen: Mindestens 2 Jahre Erfahrung im Bereich MLOps oder DevOps, sehr gute Kenntnisse in Python und Bash, Erfahrung mit Container-Orchestrierung (Kubernetes, Docker), Vertrautheit mit ML-Frameworks (PyTorch, TensorFlow) und deren Deployment, Kenntnisse in CI/CD für ML-Workloads (GitHub Actions, GitLab CI).\n\nWäre super, wenn du auch das mitbringst: Erfahrung mit Seldon Core, BentoML oder TorchServe; Kenntnisse in Infrastructure-as-Code (Terraform, Helm); Erfahrung mit Datenplattformen wie dbt oder Airflow.\n\nGehalt: 62.000 – 80.000 EUR\n\nBenefits: 100% Remote (EU-weit), 30 Tage Urlaub, jährliches Hardware-Budget (1.500 €), quartalsweise Team-Offsites in wechselnden Städten, Zuschuss zur Kinderbetreuung.\n\nBewirb dich bis 20.03.2026: https://schaltkreis-analytics.example.de/jobs/mlops-engineer\nOnline seit: 12.02.2026"
  },
  {
    "raw_text": "Zinswerk GmbH | Wien\n\nPython Entwickler – Fintech (m/w/d)\n\nVollzeit | Hybrid (Büro Wien Innere Stadt, 2 Tage Remote)\n\nZinswerk ist ein Fintech-Startup aus Wien, das innovative Lösungen im Bereich digitaler Zahlungsabwicklung entwickelt. Wir wachsen und suchen Verstärkung für unser Entwicklerteam!\n\nWas dich erwartet: Du arbeitest an unserer Zahlungsabwicklungsplattform, implementierst neue Schnittstellen zu Bankensystemen, kümmerst dich um Performance-Optimierung bei hohem Transaktionsvolumen und wirkst bei der Einhaltung regulatorischer Anforderungen (PCI-DSS) mit.\n\nWas wir uns wünschen: Mind. 3 Jahre Erfahrung in Python, Kenntnisse in asyncio und aiohttp oder FastAPI, Erfahrung mit PostgreSQL und Redis, Verständnis von Finanzdaten und Payment-Prozessen, sorgfältige Arbeitsweise und Qualitätsbewusstsein.\n\nNice to have: Erfahrung mit PSD2/Open-Banking-APIs, Kenntnisse in Celery oder ähnlichen Task-Queue-Systemen, Grundkenntnisse in React oder Vue.js.\n\nGehalt: EUR 55.000 – 70.000 brutto p.a. (Bereitschaft zur Überzahlung je nach Qualifikation)\n\nBenefits: 25 Tage Urlaub + Fenstertage, Öffi-Jahreskarte (Wiener Linien), Essenszuschuss (Sodexo-Gutscheine), flexible Arbeitszeiten mit Kernzeit 10–15 Uhr, regelmäßige Gehaltsanpassungen.\n\nBewerbungsfrist: 10.03.2026\nBewerbung unter: https://zinswerk.example.at/karriere/python-fintech\n\nVeröffentlicht am 08.02.2026"
  },
  {
    "raw_text": "Blickfeld Robotics GmbH, Nürnberg\n\nComputer Vision Engineer (m/w/d) | Vollzeit | Vor Ort\n\nBlickfeld Robotics entwickelt Bildverarbeitungslösungen für die industrielle Automatisierung. An unserem Standort in Nürnberg verbinden wir Robotik mit modernster KI.\n\nDeine Aufgaben:\nDu entwickelst Bildverarbeitungsalgorithmen für industrielle Roboteranwendungen und integrierst Kamerasysteme und Sensorik in bestehende Produktionslinien. Außerdem optimierst du die Modell-Inferenz für Echtzeit-Anforderungen, erstellst technische Dokumentation und Patentanmeldungen und arbeitest eng mit dem Mechanik- und Elektronik-Team zusammen.\n\nDein Profil:\n- Masterabschluss oder Promotion in Informatik, Elektrotechnik oder Robotik\n- Mind. 4 Jahre Erfahrung in Computer Vision oder Bildverarbeitung\n- Sehr gute Kenntnisse in Python und C++\n- Erfahrung mit OpenCV, ONNX Runtime und Kamera-Kalibrierung\n- Praxiserfahrung mit Deep-Learning-Modellen für Objekterkennung (YOLO, EfficientDet)\n\nWünschenswert: Erfahrung mit ROS2 und Echtzeit-Bildverarbeitung, Kenntnisse in 3D-Rekonstruktion und Punktwolkenverarbeitung, Erfahrung mit Edge-Deployment auf NVIDIA Jetson oder Intel OpenVINO.\n\nGehalt: 75.000 bis 95.000 EUR/Jahr\n\nUnsere Benefits: 30 Tage Urlaub, Zugang zu hochmoderner Robotik-Laborfläche, Patent-Prämien, betriebliche Altersvorsorge, Zuschuss zum Deutschlandticket.\n\nBewerbungen sind jederzeit willkommen. Mehr Informationen unter https://blickfeld-robotics.example.de/jobs/cv-engineer\n\n(Veröffentlicht am 14.02.2026)"
  },
  {
    "raw_text": "Praktikum bei Stapelwerk Datenlogistik GmbH in Leipzig!\n\nWir suchen: Praktikant:in Data Engineering\nZeitraum: 3–6 Monate, ab sofort oder nach Vereinbarung\nArbeitsort: Leipzig, vor Ort\nVergütung: 2.100 €/Monat\n\nStapelwerk Datenlogistik hilft mittelständischen Unternehmen, ihre Dateninfrastruktur zu modernisieren. Unser Team in Leipzig betreut Kunden in ganz Mitteldeutschland.\n\nDas erwartet dich:\nDu unterstützt uns beim Aufbau und der Pflege von Daten-Pipelines und arbeitest an der Migration bestehender ETL-Jobs nach Airflow mit. Außerdem führst du Datenqualitätsprüfungen durch, dokumentierst Datenmodelle und nimmst an täglichen Stand-ups und Sprint-Reviews teil.\n\nDas bringst du mit: Du studierst Informatik, Data Science oder etwas Vergleichbares (ab dem 4. Semester), hast Grundkenntnisse in Python und SQL und interessierst dich für Datenmodellierung und ETL-Prozesse. Teamfähigkeit und Neugier für neue Technologien sind uns wichtig.\n\nSchön wäre es, wenn du auch schon erste Erfahrungen mit Apache Airflow oder dbt hast, Grundkenntnisse in Cloud-Diensten (AWS, GCP) mitbringst oder dich mit Data-Warehouse-Konzepten auskennst.\n\nWas wir bieten: Flexible Arbeitszeiten, Möglichkeit zur Anfertigung der Abschlussarbeit, kostenloser Kaffee und wöchentliches Team-Mittagessen, zentrale Lage an der Karl-Liebknecht-Straße.\n\nBewirb dich bis 01.05.2026 unter https://stapelwerk.example.de/praktikum/data-engineering\n\nOnline seit 17.02.2026"
  }
]
